Catalogs/ЛБ_СхемыКредитования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_СхемыКредитования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезПродленияДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПримененияГибкогоПроцента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПрименятьАкции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказОтВыкупа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПричиныПримененияПроцентнойСхемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаПрименения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗалоговогоБилета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ЛБ_ПричиныПримененияПроцентнойСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ПричиныПримененияПроцентнойСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыЗалоговыхБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_УстановкаУсловийСхемыКредитования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановкаУсловийСхемыКредитования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей</xr:Item>
				<xr:Item>InformationRegister.ЛБ_УсловияПредоставленияКредита</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ТехническиеСтавки</xr:Item>
				<xr:Item>InformationRegister.ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЗалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастиеВРасчетах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ссуда</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусЗалогодателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УвеличениеСтоимостиЗалога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТехническиеСтавки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНачалаПрименения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ЛБ_СхемыКредитования/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	ТекРегистратор = ЛБ_УправлениеЛомбардом.ПолучитьДокументУстановкиУсловийСхемыКредитования(ТекущаяДатаСеанса(), Объект.Ссылка);
	Ссуда.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Ссуда.Параметры.УстановитьЗначениеПараметра("Регистратор", ТекРегистратор); 
	Схема.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Схема.Параметры.УстановитьЗначениеПараметра("Регистратор", ТекРегистратор); 
	ТехническиеСтавки.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка); 
	ТехническиеСтавки.Параметры.УстановитьЗначениеПараметра("Регистратор", ТекРегистратор);
	УчастиеВРасчетах.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка); 
	УчастиеВРасчетах.Параметры.УстановитьЗначениеПараметра("Регистратор", ТекРегистратор);
	ВсеУсловия.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
		                  
	Если НЕ РольДоступна("Администрирование") Тогда
		Элементы.Код.Видимость = ложь;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.ДатаСоздания = ТекущаяДатаСеанса();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Если Объект.ПричиныПримененияПроцентнойСхемы.Количество() = 0 Тогда
			НоваяСтр = Объект.ПричиныПримененияПроцентнойСхемы.Добавить(); 
			НоваяСтр.ПричинаПрименения = ПредопределенноеЗначение("Перечисление.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма");
			НоваяСтр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен; 
		КонецЕсли;	
	КонецЕсли;
	
	Если Объект.ПризнакПримененияГибкогоПроцента Тогда 
		Элементы.БезПродленияДоговора.ТолькоПросмотр = Истина; 
		Элементы.ПричиныПримененияПроцентнойСхемы.ТолькоПросмотр = ложь;
	Иначе     
		Элементы.БезПродленияДоговора.ТолькоПросмотр = ложь;
		Элементы.ПричиныПримененияПроцентнойСхемы.ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры 


//&НаКлиенте
//Процедура ОбработкаКомандыЗавершение(Результат,ДополнительныеПараметры) Экспорт
//		
//	Схема.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);	
//	
//КонецПроцедуры


//&НаКлиенте
//Процедура ОбработкаКомандыЗавершение2(Результат,ДополнительныеПараметры) Экспорт
//		
//	Ссуда.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);	
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)   
	Если Объект.ПричиныПримененияПроцентнойСхемы.Количество() = 0 Тогда 
		Сообщить("Не выбраны причины применения процентной схемы!");
		Отказ = Истина;  
	Иначе
		Для каждого стр Из Объект.ПричиныПримененияПроцентнойСхемы цикл 
			Если НЕ ЗначениеЗаполнено(Стр.ПричинаПрименения) Тогда
				Сообщить("Не заполнена причина применения процентной схемы!");
		        Отказ = Истина;  
				Прервать;
			КонецЕсли;	
		Конеццикла;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НаименованиеКраткое) Тогда
		Сообщить("Не заполнено краткое наименование (поле может содержать только буквы и цифры)!");
		Отказ = Истина;
	Иначе	
		ТолькоРазрешенныеСимволы = ЛБ_ОбщегоНазначения.ПроверитьСтроку(Объект.НаименованиеКраткое,"[A-Za-zА-Яа-я0-9]+");
		Если Не ТолькоРазрешенныеСимволы Тогда
			Сообщить("Краткое наименование должно содержать только буквы и цифры!");
			Отказ = Истина;
		КонецЕсли;    
	КонецЕсли;	
 КонецПроцедуры

&НаКлиенте
Процедура ПризнакПримененияГибкогоПроцентаПриИзменении(Элемент) 
	Если НЕ Объект.ПризнакПримененияГибкогоПроцента Тогда   
		Объект.ПричиныПримененияПроцентнойСхемы.Очистить();
		НоваяСтр = Объект.ПричиныПримененияПроцентнойСхемы.Добавить(); 
		НоваяСтр.ПричинаПрименения = ПредопределенноеЗначение("Перечисление.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма");  
		НоваяСтр.СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Оформлен");
		Элементы.БезПродленияДоговора.ТолькоПросмотр = Ложь;
		Элементы.ПричиныПримененияПроцентнойСхемы.ТолькоПросмотр = Истина;
	Иначе
		Объект.БезПродленияДоговора = Ложь; 
		Элементы.БезПродленияДоговора.ТолькоПросмотр = Истина;  
		Элементы.ПричиныПримененияПроцентнойСхемы.ТолькоПросмотр = ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура БезПродленияДоговораПриИзменении(Элемент)
	Если Объект.БезПродленияДоговора Тогда  
		Объект.ПризнакПримененияГибкогоПроцента = Ложь;  
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда 
		ТекущийОбъект.ДатаСоздания = ТекущаяДатаСеанса();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУсловие(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Предупреждение("Перед добавлением условия необходимо записать схему кредитования. Нажмите кнопку «Записать»", 60);     
		Возврат;
	КонецЕсли;	  
	
	ОбработкаПослеДобавления = Новый ОписаниеОповещения("ПослеДобавления", Этаформа);
	ПараметрыФормы = Новый структура;
	ПараметрыФормы.Вставить("СхемаКредитования", Объект.Ссылка);
	ОткрытьФорму("Документ.ЛБ_УстановкаУсловийСхемыКредитования.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОбработкаПослеДобавления, РежимоткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьУсловие(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Предупреждение("Перед добавлением условия необходимо записать схему кредитования. Нажмите кнопку «Записать»", 60);     
		Возврат;
	КонецЕсли;	  
	
	//+МАН 08.12.25 Добавлена проверка и копирование выделенного документа
	//Было: 
	//ДокументКопирования = ПолучитьАктульныйДокумент();
	//Если ДокументКопирования = неопределено Тогда 
	//	Предупреждение("Не найден актуальный документ установки условий по кредитной схеме", 60);     
	//	Возврат;
	//КонецЕсли;

	Если ТекущийЭлемент.Имя = "ВсеУсловия" И ТекущийЭлемент.ТекущиеДанные <> Неопределено Тогда
		ДокументКопирования = ТекущийЭлемент.ТекущиеДанные.Ссылка;
	Иначе
		ДокументКопирования = ПолучитьАктульныйДокумент();
		Если ДокументКопирования = неопределено Тогда 
			Предупреждение("Не найден актуальный документ установки условий по кредитной схеме", 60);     
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//-МАН

	ОбработкаПослеДобавления = Новый ОписаниеОповещения("ПослеДобавления", Этаформа);
	ПараметрыФормы = Новый структура;
	ПараметрыФормы.Вставить("ДокументКопирования", ДокументКопирования);
	ОткрытьФорму("Документ.ЛБ_УстановкаУсловийСхемыКредитования.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОбработкаПослеДобавления, РежимоткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


Функция ПолучитьАктульныйДокумент()
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Ссылка", объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛБ_УстановкаУсловийСхемыКредитования.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_УстановкаУсловийСхемыКредитования КАК ЛБ_УстановкаУсловийСхемыКредитования
	               |ГДЕ
	               |	ЛБ_УстановкаУсловийСхемыКредитования.СхемаКредитования = &Ссылка
	               |	И ЛБ_УстановкаУсловийСхемыКредитования.Проведен = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_УстановкаУсловийСхемыКредитования.Дата УБЫВ"; 
	Выборка = Запрос.Выполнить().Выбрать();  
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ссылка;
	КонецЕсли;
	Возврат неопределено;
КонецФункции

&НаКлиенте
Процедура ПричиныПримененияПроцентнойСхемыПричинаПримененияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Отбор = новый Структура;
	Отбор.Вставить("ПричинаПрименения", ВыбранноеЗначение); 
	Строки = Объект.ПричиныПримененияПроцентнойСхемы.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		Предупреждение("Причина применения процентной схемы " + СокрЛП(ВыбранноеЗначение) + " уже добавлена в таблицу!", 60);
	    ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ЛБ_ПричиныПримененияПроцентнойСхемы.ПустаяСсылка");  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВсеУсловияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока  = Элементы.ВсеУсловия.ТекущиеДанные;  
	ПараметрыФормы = Новый Структура("Ключ", ТекСтрока.Ссылка);
	ОткрытьФорму("Документ.ЛБ_УстановкаУсловийСхемыКредитования.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда   
		Если ПолучитьАктульныйДокумент() = неопределено Тогда   
			Режим = РежимДиалогаВопрос.ДаНет;
      	    Ответ = Вопрос("У схемы кредитования нет актуальных условий. Закрыть форму?", Режим, 0, КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Отказ = Истина;
		    КонецЕсли; 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьДокумент(Команда)
	ТекСтрока = Элементы.ВсеУсловия.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда  
		ОбработкаПослеДобавления = Новый ОписаниеОповещения("ПослеДобавления", Этаформа);
		ПараметрыФормы = Новый структура;
		ПараметрыФормы.Вставить("ДокументКопирования", ТекСтрока.Ссылка);
		ОткрытьФорму("Документ.ЛБ_УстановкаУсловийСхемыКредитования.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОбработкаПослеДобавления, РежимоткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаСервере 
Процедура ПолучитьДокументУстановкиУсловийСК()  
	ТекРегистратор = ЛБ_УправлениеЛомбардом.ПолучитьДокументУстановкиУсловийСхемыКредитования(ТекущаяДатаСеанса(), Объект.Ссылка);
	Ссуда.Параметры.УстановитьЗначениеПараметра("Регистратор", ТекРегистратор); 
	Схема.Параметры.УстановитьЗначениеПараметра("Регистратор", ТекРегистратор);  
	ТехническиеСтавки.Параметры.УстановитьЗначениеПараметра("Регистратор", ТекРегистратор); 
	УчастиеВРасчетах.Параметры.УстановитьЗначениеПараметра("Регистратор", ТекРегистратор);
КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавления(Результат, ДопПараметры) Экспорт  
	ПолучитьДокументУстановкиУсловийСК();
	Элементы.ВсеУсловия.Обновить(); 
	Элементы.Ссуда.Обновить();
	Элементы.Схема.Обновить();
	Элементы.ТехническиеСтавки.Обновить();
	Элементы.УчастиеВРасчетах.Обновить();
КонецПроцедуры	

&НаКлиенте
Процедура ПричиныПримененияПроцентнойСхемыСтатусЗалоговогоБилетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ТекСтр = ТекущийЭлемент.ТекущиеДанные;
	Если ТекСтр.ПричинаПрименения = ПредопределенноеЗначение("Перечисление.ЛБ_ПричиныПримененияПроцентнойСхемы.ОплатаПроцентов") Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Оформлен"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Продлен"));
	ИначеЕсли ТекСтр.ПричинаПрименения = ПредопределенноеЗначение("Перечисление.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма") Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Оформлен"));
	КонецЕсли;
КонецПроцедуры
